Autodesk.Revit.DB.Part.GetSourceElementOriginalCategoryIds
Gets the category ids of the source elements which were used to form this part.
Returns:
The category ids.
Since:
2013

Autodesk.Revit.DB.Part.GetSourceElementIds
Gets a collection of elements from which this Part is created by the PartMaker.
May return more than one source only if there is merge involved somewhere in the history of this Part.
Remarks:
A source element is one of the elements in the original file that the PartMaker uses to create a Part.
For example, a floor or a wall used to create a Part can be called a source element.
Returns:
The collection of elements
Since:
2013

Autodesk.Revit.DB.Part.ResetFaceOffset(Autodesk.Revit.DB.Face)
Resets the offset applied to the given part face.
face:
The face whose offset needs to be reset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Part.ResetPartShape
Resets all face offsets applied to part faces.
Since:
2012

Autodesk.Revit.DB.Part.GetFaceOffset(Autodesk.Revit.DB.Face)
Get face offset of the given part face.
face:
The face whose offset is required.
Returns:
Returns the value of the offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Part.SetFaceOffset(Autodesk.Revit.DB.Face,System.Double)
Offsets the given part face in the direction that points out of the solid shape with the specified amount.
Negative value will offset the face into the solid shape.
face:
The face to offset.
offset:
The magnitude of the offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
-or-
The face to be offset should be planar and satisfy constraints of its parent element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Part.CanOffsetFace(Autodesk.Revit.DB.Face)
Checks if it is possible to offset the given face.
face:
face to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Part.PartMaker
The PartMaker that created this Part.
Since:
2012

Autodesk.Revit.DB.Part.Excluded
True if the part is excluded, false otherwise
Since:
2013

Autodesk.Revit.DB.Part.OriginalCategoryId
The category Id of the original element corresponding to this Part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: dPartOriginalCategoryId is not an available member of the original category ids of the elements which formed this Part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Part
This element represents a part of another element.
Remarks:
A part is associated with a PartMaker element that creates it.
Since:
2012